Revit 2026 API

# FieldValues Properties

---

The FieldValues type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FieldValues Class

Autodesk.Revit.DB.Analysis Namespace